# 新项目：pandas数据处理

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
s=pd.Series([1,3,5,np.nan,6,8])#创建一个系列，单列，顺序Series 是一个值的序列，它只有一个列，以及索引

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates=pd.date_range('20130101',periods=6)#创建时间范围函数，6天

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('abcd'))#np.random.randn(6,4)产生随机的6行四列数据，同时以时间做索引，list做行

In [9]:
df

                   a         b         c         d
2013-01-01  0.821586  0.096789  1.386433 -0.441738
2013-01-02 -1.724557 -1.755271 -0.621844  0.981378
2013-01-03 -0.344055  0.332185  0.543922  0.484370
2013-01-04 -0.483240  1.266857 -2.234449 -0.076641
2013-01-05  1.578779 -1.229717 -1.047982  1.323505
2013-01-06 -1.192755 -1.098299 -1.287910  0.040329

In [10]:
#参数是一个 dict，每个 dict 的 value 会被转化成一个 Series
df2=pd.DataFrame({'a':1.,
                  'b':pd.Timestamp('20130102'),
                  'c':pd.Series(1,index=list(range(4)),dtype='float32'),#创建一个内容为1，索引为list：1-4的floata32的系列
                  'd':np.array([3]*4,dtype='int32'),#创建数组『3』×4
                  'e':pd.Categorical(["test","train","test","train"]),#增加分类数组，并赋值
                  'f':'foo'})

In [11]:
df2

     a          b    c  d      e    f
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes#查看对应列的指导类型

a           float64
b    datetime64[ns]
c           float32
d             int32
e          category
f            object
dtype: object

In [13]:
df.head(1)#查看顶端几行

                   a         b         c         d
2013-01-01  0.821586  0.096789  1.386433 -0.441738

In [14]:
df.tail(2)#查看底端几行

                   a         b         c         d
2013-01-05  1.578779 -1.229717 -1.047982  1.323505
2013-01-06 -1.192755 -1.098299 -1.287910  0.040329

In [15]:
df2.index#可单独查看索引index和行cloums或者值values

Int64Index([0, 1, 2, 3], dtype='int64')

In [16]:
df.describe()#显示数据概要，包括计数count，方差std，平均值mean

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean  -0.224040 -0.397909 -0.543638  0.385200
std    1.234102  1.146655  1.310055  0.672568
min   -1.724557 -1.755271 -2.234449 -0.441738
25%   -1.015376 -1.196863 -1.227928 -0.047398
50%   -0.413647 -0.500755 -0.834913  0.262350
75%    0.530176  0.273336  0.252480  0.857126
max    1.578779  1.266857  1.386433  1.323505

In [17]:
df2.T#行列转置换

,0,1,2,3
a,1,1,1,1
b,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
c,1,1,1,1
d,3,3,3,3
e,test,train,test,train
f,foo,foo,foo,foo

In [18]:
df.sort_index(axis=0,ascending=False)#对维度排序，0行，1列，ascengding表示正序

                   a         b         c         d
2013-01-06 -1.192755 -1.098299 -1.287910  0.040329
2013-01-05  1.578779 -1.229717 -1.047982  1.323505
2013-01-04 -0.483240  1.266857 -2.234449 -0.076641
2013-01-03 -0.344055  0.332185  0.543922  0.484370
2013-01-02 -1.724557 -1.755271 -0.621844  0.981378
2013-01-01  0.821586  0.096789  1.386433 -0.441738

In [19]:
df.sort_values(by='a')#以特定系列的值排序

                   a         b         c         d
2013-01-02 -1.724557 -1.755271 -0.621844  0.981378
2013-01-06 -1.192755 -1.098299 -1.287910  0.040329
2013-01-04 -0.483240  1.266857 -2.234449 -0.076641
2013-01-03 -0.344055  0.332185  0.543922  0.484370
2013-01-01  0.821586  0.096789  1.386433 -0.441738
2013-01-05  1.578779 -1.229717 -1.047982  1.323505

In [20]:
df['b']#根据系列名获取单独序列(df.a)或者df【0：3】数组范围

2013-01-01    0.096789
2013-01-02   -1.755271
2013-01-03    0.332185
2013-01-04    1.266857
2013-01-05   -1.229717
2013-01-06   -1.098299
Freq: D, Name: b, dtype: float64

In [21]:
df.b#与上句一致，而且更简便

2013-01-01    0.096789
2013-01-02   -1.755271
2013-01-03    0.332185
2013-01-04    1.266857
2013-01-05   -1.229717
2013-01-06   -1.098299
Freq: D, Name: b, dtype: float64

In [22]:
df.loc[dates[0]]#筛选条件的数据，包括但不仅限于使用【：【‘a’，‘b’】】

a    0.821586
b    0.096789
c    1.386433
d   -0.441738
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
df.at[dates[0],'a']#比较快速的获取具体某个元素，类似有df。iat【】

0.8215864130961721

In [24]:
df.iloc[3]#获取对应行数据，包括但不仅限于使用那个list【】参数，以逗号隔开，与df。【】不同为显示的数据为行列互置

a   -0.483240
b    1.266857
c   -2.234449
d   -0.076641
Name: 2013-01-04 00:00:00, dtype: float64

In [25]:
df[df.a>0]#布尔值判断，对a组进行筛选

                   a         b         c         d
2013-01-01  0.821586  0.096789  1.386433 -0.441738
2013-01-05  1.578779 -1.229717 -1.047982  1.323505

In [26]:
df[df>0]#对比上句，可以看出，【】内代表显示数据

                   a         b         c         d
2013-01-01  0.821586  0.096789  1.386433       NaN
2013-01-02       NaN       NaN       NaN  0.981378
2013-01-03       NaN  0.332185  0.543922  0.484370
2013-01-04       NaN  1.266857       NaN       NaN
2013-01-05  1.578779       NaN       NaN  1.323505
2013-01-06       NaN       NaN       NaN  0.040329

In [27]:
df3=df.copy()#复制元素

In [28]:
df3['e']=['one','one','one','two','two','three']

In [29]:
df3[df3['e'].isin(['one'])]#判断是否在集合中，适用字符，数值有更好的方式

                   a         b         c         d    e
2013-01-01  0.821586  0.096789  1.386433 -0.441738  one
2013-01-02 -1.724557 -1.755271 -0.621844  0.981378  one
2013-01-03 -0.344055  0.332185  0.543922  0.484370  one

In [30]:
s1=pd.Series([1,3,5,4,6,8],index=pd.date_range('20130102',periods=6))

In [31]:
df['f']=s1
df

                   a         b         c         d    f
2013-01-01  0.821586  0.096789  1.386433 -0.441738  NaN
2013-01-02 -1.724557 -1.755271 -0.621844  0.981378  1.0
2013-01-03 -0.344055  0.332185  0.543922  0.484370  3.0
2013-01-04 -0.483240  1.266857 -2.234449 -0.076641  5.0
2013-01-05  1.578779 -1.229717 -1.047982  1.323505  4.0
2013-01-06 -1.192755 -1.098299 -1.287910  0.040329  6.0

In [32]:
df.at[dates[5],'f']=0#相似使用df。iat【】

In [33]:
df.dropna()#丢弃nan行

                   a         b         c         d    f
2013-01-02 -1.724557 -1.755271 -0.621844  0.981378  1.0
2013-01-03 -0.344055  0.332185  0.543922  0.484370  3.0
2013-01-04 -0.483240  1.266857 -2.234449 -0.076641  5.0
2013-01-05  1.578779 -1.229717 -1.047982  1.323505  4.0
2013-01-06 -1.192755 -1.098299 -1.287910  0.040329  0.0

In [37]:
df.fillna(values=5)#为nan赋值

TypeError: fillna() got an unexpected keyword argument 'values'

In [35]:
pd.isnull(df)#判断哪些值是nan

                a      b      c      d      f
2013-01-01  False  False  False  False   True
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False  False
2013-01-04  False  False  False  False  False
2013-01-05  False  False  False  False  False
2013-01-06  False  False  False  False  False

In [36]:
df.mean()#各列平均值，df。mean（1）对行维度取平均

a   -0.224040
b   -0.397909
c   -0.543638
d    0.385200
f    2.600000
dtype: float64

In [38]:
df

                   a         b         c         d    f
2013-01-01  0.821586  0.096789  1.386433 -0.441738  NaN
2013-01-02 -1.724557 -1.755271 -0.621844  0.981378  1.0
2013-01-03 -0.344055  0.332185  0.543922  0.484370  3.0
2013-01-04 -0.483240  1.266857 -2.234449 -0.076641  5.0
2013-01-05  1.578779 -1.229717 -1.047982  1.323505  4.0
2013-01-06 -1.192755 -1.098299 -1.287910  0.040329  0.0

In [43]:
new=[df[1:2],df[:3],df[2:]]#截取特点的数据
new

In [44]:
new2=pd.concat(new)#然后简单的拼接
new2

                   a         b         c         d    f
2013-01-02 -1.724557 -1.755271 -0.621844  0.981378  1.0
2013-01-01  0.821586  0.096789  1.386433 -0.441738  NaN
2013-01-02 -1.724557 -1.755271 -0.621844  0.981378  1.0
2013-01-03 -0.344055  0.332185  0.543922  0.484370  3.0
2013-01-03 -0.344055  0.332185  0.543922  0.484370  3.0
2013-01-04 -0.483240  1.266857 -2.234449 -0.076641  5.0
2013-01-05  1.578779 -1.229717 -1.047982  1.323505  4.0
2013-01-06 -1.192755 -1.098299 -1.287910  0.040329  0.0

In [46]:
left=pd.DataFrame({'key':['a','a'],'valuse':[1,2]})
right=pd.DataFrame({'key':['a','b'],'valuse':[3,4]})

In [48]:
pd.merge(left,right,on='key')#join方式进行连接

  key  valuse_x  valuse_y
0   a         1         3
1   a         2         3